# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterMap..::..Item Property
ParameterMap Class See Also
---
Gets or sets an item at a specified key within the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Parameter this[
	string key
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	key As String _
) As Parameter
	Get
	Set
```

Visual C++
---
```text
public:
virtual property Parameter^ Item[String^ key] {
	Parameter^ get (String^ key);
	void set (String^ key, Parameter^ value);
}
```

# ### Parameters
key
    Type: System..::..StringThe key of the item to be set or retrieved.
# ### Return Value
Returns the object at the specified key.
# See Also
ParameterMap Class
Autodesk.Revit.DB Namespace